// 2) გამოიყანეთ buffer მოდული იმსათვის რ0ომ შექმნატ ხელოვნურად რაღაცა მეხსიერება 10 ადგილით და შეავსეთ ეგ მასივი სიმბოლოებით, შემდეგ კი გამოიყენეთ toString მეთოდი რომ რეალურ სტრინგად გარდაქმნათ, აგრეტვე გამოიყენეთ buffer მოდულის from მეთოდი იმსიასათვის რომ გაიგო კონკრეტულ სტრინგიში ყველა სიმბიოლოს კოდი (კომენტარებით ახსენით რა არის buffer და რა არიოს ორობითი  binaryმონაცემი)

const { buffer } = require("stream/consumers")
const list = ["a", "b", "c", "d", "e", "f", "h", "i", "j", "k"]
const newList = buffer(list.toString())

console.log(newList)