// 1) შექმენით რიცხვების მასივი, სადაც გექნებაათ 10 რიცხვი, გამოიყენეთ map მეთოდი, და გააკეთეთ ესეთი რამ, თუ ინდექსი არის ლუწი მაშინ ამჟამინდელი რიცხვი გაამრავლეთ 2 ზე ხოლო თუ არის კენტი მაშინ დააბრუნეთ ხელშეუხებლად ამჟამინდელი რიცხვი, შემდეგ კი იგივე რამე გააკეთეთ თქვენი კლონი მეთოდით ახსენით დეტალურად თქვენი კლონი კომენტარებით

const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const evenOrOdd = numbers.map(numbers => numbers % 2 === 0, () => {
    if (numbers % 2 === 0) {
        return numbers * 2;
    } else {
        return "odd";
    }
})

console.log(evenOrOdd);


// 2)შექმენით რიცხვების მასივი სადაც გექნებათ 10 რიცხვი, თქვენი დავალებაა გაფილტროთ ეს მასივი და დააბრუნოთ ახალი მასივი სადაც მოთავსებული იქნება ისეთი რიცხვები რომელიც ორიგინალ მასივიში მეორდება ზუსტად 2ჯერ, შექმენით filter მეთოდის კლონი და გააკეთეთ იგივე რამე (აუცილებლად ახსენით დეტალურად თვენი კლონის მუშაობა)

const numberList = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const filter = numberList.filter(numberList => numberList * 2)