// ახსენით კომენტარებით რა განსხვავებაა ჩვეულებრივ და arrow ფუნქციებს შორის

// normal function
// ჩვეულებრივი ფუნქციის შექმნა როცა გვინდა ჩვენ ვიყენებთ function keyword-ს და მის ბლოკში ვწერთ კოდს

function myFunc() {
    return "Hello world!";
}

// arrow function
// როცა გვინდა ჩვენ შევქმნათ ისრის ფუნქცია ჩვენ ვაკეთბთ ამას ცვლადში მაგრამ უფრო ხშირად კეთდება კონსტანტაში, arrow ფუნქცია იმისთვის არსებობს რომ უფრო მარტივად და მოკლედ რომ შევქმნათ ფუნქცი და რომ არ მოგვიწიოს წვალება ჩვეულებრივი ფუნქციის დაწერას

const arrowFunc = () => {
    return "Hello world";
}