// 1) შექმენით ორი ფაილი, პირველის სახელი იყოს calculator.js ხოლო მეორე index.js, პირველ ფაილში შექმენით ფუნქცია რომელიც იღებს ორ არგუმენტს და ერთ ოპერაციას, გამოიყენეთ შესაბამის ოპერატორი რომ დააბრუნოთ ფუნქციიდან შედეგი, დააექსპორტეთეს ფუნქცია და გადაიტენეთ index.js ფაილში გამოიყენეთ module.exports და require() ახსენით რისთვის გამოიყენება თითოეული

import calculator from "./calculator";
import filter from "./calculator";

console.log(calculator(1, 1, "+"));

// 2) იგივე ფაილში შექმენით ფუნქცია სახელად filter რომელსაც გადაეცემა ერთი მასივი და მეორე ფუნცია არგუმენტად, გადაუარეთ ფორ ციკლით მასივს და ყველა მნიშვნელობაზე გამოიძახეთ ფუნქცია რომელიც არგუმენტად მიიღეთ, მაგ ფუნქციას კი გადაეცით რიგრიგობით მნიშვნელობები, დაბრუნებული მნიშვნელობა კი შეინახეთ ახალ მასივში და დააბრუნეთ ეგ მასივი, filter and calculator ფუნქცია გადაიტანეთ  index.js ფაილში და ორივე გამოიძახეთ

console.log(filter([1, 2, 3, 4, 5], (index1, index2, index3) => {
    const lst = [index1, index2, index3];

    return lst;
}));