// 1) დააიმპორტეთ events მოდული, დაიმპორტების შემდეგ ახსენით რას წარმოადგენს ის და რაში შეიძლება ამ მოდულის გამოყენება, შემდეგ გამოიყენეთ მაგ მოდულში არსებული კლასი EventEmitter, რომ შექმნათ მოვლენის გამომწვევი ობიექტი, შეინახეთ ის კონსტანტაში სახელად myEvents, ამ ობიექტით შექმენით 2 მოვლენა click and submit ორივე მოვლენა გამოიწვიეთ emit მეთოდით, აგრეთვე კომენტარებით ახსენით რა არის on და emit მეთოდები

const events = require("events"); // ეს მოდული ისმისთვის დაგვჭირდება რომ შევქნათ რამე მოვლენა
const myEvents = new events.EventEmitter();

myEvents.on("click", () => {
    console.log("clicked!")
})

myEvents.on("submit", () => {
    console.log("submitted!")
})

myEvents.emit("click")
myEvents.emit("submit")

// on-ი არის მეთოდი რომელიც მაგის მეშვეობით შევქნით მოვლენას მაგალითად და-click-ებისთვის ან რაღაცის შეცვლის მერე და კიდე სხვა, ის შეიცავს ორ არგუმენტს: 1 არგუმენტი: მოვლენა, 2 არგუმენტი: ფუნქცია რომელიც მაგ მოვლენის დროს გაეშვება