// 2) გააკეთეთ 3-3 მაგალითი თითოეულ ეთოდზე და ახსენით თქვენი სიტყვებით თუ რას აკეთებს ეს მეთოდები

// 1)

const array = ["Element1", "Element2", "Element3"]; // შევქმენით მასივი სადაც გვექნება 3 ელემენტი და ამ 3 ელემენტით გავიგებთ მათ ინდექსს

// indexOf მეთოდის ის დახმარებით ჩვენ ვეძებს სიის ელემენტის ინდექსს

console.log(array.indexOf("Element1")); // element1-ის ინდექსი არის 0 ამიტომაც გამოიტანს 0 რადგან 0-იდან იწყება ინდექსების ათვლა
console.log(array.indexOf("Element2")); // element2-ის ინდექსი არის 1 ამიტომაც გამოიტანს 1
console.log(array.indexOf("Element3")); // element3-ის ინდექსი არის 2 ამიტომაც გამოიტანს 2

// 2)

const secondArray = ["Element1", "Element2", "Element3"]; // შექმენით მასივი სადაც გვაქს 3 ელემენტი და ეს ელემენტები შემობრუნებული უნდა დავბეჭდოთ

// reverse მეთოდის გამოყენებით ჩვენ შემოვაბრუნებთ ჩვენს მასივს

secondArray.reverse() // შევაბრუნეთ ჩვენი მასივი

console.log(secondArray) // დავბეჭდეთ

// 3)

const thirdArray = ["Element1", "Element2", "Element3", "Element1"]; // შევქმენით მასივი სადაც გვაქს 4 ელემენტი მაგრამ მასივის პირველი ინდექსი და ბოლო ინდექსი ერთი და იგივეა და მაგ ბოლო ელემენტის ინდექსი უნდა გავიგოთ

// lastIndexOf მეთოდის გამოყენებით ჩვენ გავიგებთ სიის ბოლო ინდექსს როცა ორი ელემენტი ან რამოდენიმე ელემენტი ერთნაირია

console.log(thirdArray.lastIndexOf("Element1"));

// 4)

const fourthArray = ["Element1", "Element2", "Element3"]; // შევქმენით მასივი სადაც გვაქვს 4 ელემენტი და ამ სიაში გადავამოწმებთ რაღაცა ელემენტი თუ არსებოს ამ სიაში

// include მეთოდის გამოყენებით ჩვენ გავიგებთ თუ არის სიაში რაღაცა ელემენთი, თუ არ არის გამოგვიტანს false, თუ არის გამოგვიტანს true

console.log(fourthArray.includes("Element1")); // Element1 არსებობს ჩვენს სიაში ამიტომაც გამოგვიტანს True
console.log(fourthArray.includes("Element4")); // Element4 არ არსებობს ჩვენს სიაში ამიტომაც გამოგვიტანს False