// 1) ყველა ახალ ნასწავლი მეთოდის გამოყენებით შექმენით თითოეულ ატგანზე 2-2 მაგალითი და ახსენით კომენტარებით თქვენი სიტყვებით თუ რას აკეთებს თითოეული მეთოდი

// 1)

const array = ["Element1"]; // შევქმენით მასივი სადაც გვაქვს ერთი ელემენტი

array.push("Element2"); // დავამატეთ ახალი ელემენტი ბოლო ინდექსზე

console.log(array); // დავბეჭდეთ ჩვენი მასივი output: ["Element1", "Best"]

// 2)

const secondArray = ["Element1", "Element2"]; // შევქმენით მასივი სადაც გვაქს ორი ელემენტი

secondArray.pop(); // ამოვშალეთ ელემენტი მასივის ბოლო ინდექსზე

console.log(secondArray); // დავბეჭდეთ მასივი output: ["Element1"]