// 3) შემოდის n და n ზომის მასივი. თქვენი  ამოცანაა თითოეული ელემენტისთვის დაბეჭდოთ მის მარცხნივ მყოფ ელემენტებს შორის რამდენზე მეტია იგი.

// მაგ  n=5, 3 2 6 5 1

// პასუხია 0,0,2,2,0  (3-ის წინ არცერთი ელემეტნია, 2ის წინ 3ია თუმცა არაა მასზე მეტი , 6ის წინ 3 და 2  წერია რადგან ორივეზე მეტია დაიბეჭდება 2, 5ის 3 2 6 წერია ამათგან 2 მათგანზე მეტია აქაც 2 და ბოლოს 1იანი არცერთზე მეტი არაა და დაიბეჭდება 0 )

let arr = [3, 2, 6, 5, 1];

let result = [];

for (let i = 0; i < arr.length; i++) {
    let count = 0;
    for (let j = 0; j < arr.length; j++) {
        if (arr[j] > arr[i]) {
            count++;
        }
    }
    result.push(count);
}

console.log(result);