#codewars

#დავალება 1:  შექმენით პროგრამა, რომელსაც გადასცემთ სიას, სადაც გექნებათ მთელი რიცხვები. თქვენი დავალებაა, რომ ამ სიის ორი მინიმალური რიცხვის ჯამი დააბრუნოთ: ([5, 8, 12, 18, 22]), 13), ([7, 15, 12, 18, 22]), 19), ([25, 42, 12, 18, 22]), 30)

number_list = [5, 8, 12, 18, 22]
for i in range(len(number_list)):
    if i % 2:
        print(number_list)

#დავალება 2:  შექმენით პროგრამა რომელსაც გადასცემთ მთელი რიცხვების სიას. შემდეგ უნდა მოახდინოთ გაფილტვრა: ახალ სიაში გადაიტანოთ მარტო ლუწი რიცხვები. ბოლოს კი დააბრუნოთ ახალი სია. 

#test cases: [1, 2, 3, 4] -> [2, 4]

#homework

numbers_lists1 = [1, 2, 3, 4]
numbers_lists2 = [2, 4]
print(numbers_lists2)

#დავალება 3: შექმენით პროგრამა, სადაც გადმოგეცემათ სიები და თქვენ მოახდენთ ფილტრაციას. თუ პირველ და მეორე სიაში ერთი და იგივე ინდექსზე მყოფი ელემენტი იგივე იქნება, მთვლელს დაამატეთ 4 ქულა. თუ რომელიმე ელემენტი იქნება "" - ანუ ცარიელი სთრინგი, მთვლელი არ შეცვალოთ. ხოლო თუ გექნებათ განსხვავებული ელემენტები, მთვლელს გამოაკელით ერთი ქულა. იმუშავეთ შემდეგ სიებზე: ["a", "a", "b", "b"], ["a", "c", "b", "d"] ["a", "a", "c", "b"], ["a", "a", "b",  ""] ["a", "a", "b", "c"], ["a", "a", "b", "c"] ["b", "c", "b", "a"], ["",  "a", "a", "c"]

#test cases: ["a", "a", "b", "b"], ["a", "c", "b", "d"]) → 6 ["a", "a", "c", "b"], ["a", "a", "b",  ""]) → 7 ["a", "a", "b", "c"], ["a", "a", "b", "c"]) → 16 ["b", "c", "b", "a"], ["",  "a", "a", "c"]) → 0

#homework

#მთვლელი 1

list1 = ["a", "a", "b", "b"]
list1_index = ""
     #0, 1, 2, 3

list2 = ["a", "c", "b", "d"]
list2_index = ""
     #0, 1, 2, 3

for list1 in range(len(list2)):
    if list1 == list2:
        print(+4)

#მთვლელი 2

list1 = ["a", "a", "c", "b"]
list1_index = ""
     #0, 1, 2, 3

list2 = ["a", "a", "b",  ""]
list2_index = ""
     #0, 1, 2, 3

for list1 in range(len(list2)):
    if list1 >= list2:
        print(-1)